import React, { FC } from 'react';
import * as styles from './styles.scss';

export const Philosophy: FC = () => {
  return (
    <article className={styles.article}>
      <h1>Философия NordClan</h1>

      <p>
        <strong>Философия NordClan</strong> - это набор ценностей и убеждений, которыми мы руководствуемся каждый день в своей работе, то во что мы
        верим и к чему стремимся, то что нас объединяет и делает нас сильнее остальных.
      </p>

      <blockquote>
        <p>Величайшее применение жизни - это потратить ее на нечто более долговечное, чем она сама.</p>
        <cite>Уильям Джеймс.</cite>
      </blockquote>

      <p>
        NordClan - это команда профессионалов - универсалов, целеустремленных личностей, для которых результат всегда важнее
        процесса.
      </p>

      <p>
        Разработка программного обеспечения для нас — это возможность погрузиться в бизнес клиента, увидеть в нем возможности для
        роста и реализовать их за счет создания и внедрения новых цифровых сервисов. Это и есть предназначение компании Nord Clan.
      </p>

      <h2>Всегда можно больше</h2>

      <p>
        Мы верим в необходимость непрерывного улучшения и совершенствования себя, своей компании, своих клиентов и никогда не
        останавливаемся на достигнутом.
      </p>

      <p>Мы создаем системы, которые помогают другим людям достигать целей.</p>

      <p>Мы зарабатываем деньги, чтобы всегда иметь возможность оставаться независимыми.</p>

      <h2>Только вместе</h2>

      <p>Мы - это наши сотрудники и наши клиенты. Только вместе.</p>

      <p>Мы за партнерские взаимовыгодные отношения с нашими клиентами. Наши клиенты помогают нам, а мы помогаем им.</p>

      <p>Мы с теми, с кем нам по пути. Будь то сотрудник или клиент.</p>

      <p>Нам интересен данный сегмент бизнеса, мы изучаем его и знаем о нем многое, а значит можем предложить оптимальный вариант
        реализации ПО.</p>

      <p>
        Каждый сотрудник - это лицо компании, обладающий уникальными способностями и способный помочь в реализации наших целей.
      </p>

      <h2>Наша уникальность и экспертиза</h2>

      <p>
        Мы владеем множеством технологий разработки и языков программирования, а также собираем, изучаем и применяем лучшие
        компоненты, решения, сторонние системы и интеграции с сервисами (например платежные системы, мессенджеры, речевые
        помощники и т.д), которые позволяют клиенту сразу и быстро получать результат, не спотыкаясь о дилетантские “вам нужна
        1000 часов аналитики, ̶т̶а̶к̶ ̶к̶а̶к̶ ̶м̶ы̶ ̶н̶е̶ ̶п̶о̶н̶я̶л̶и̶ ̶в̶а̶ш̶и̶ ̶т̶р̶е̶б̶о̶в̶а̶н̶и̶я̶”, “напишем ЦРМ на яве с
        нуля, ̶ ̶и̶ ̶э̶т̶о̶ ̶о̶б̶о̶й̶д̶е̶т̶с̶я̶ ̶в̶а̶м̶ ̶д̶о̶р̶о̶ж̶е̶ ̶в̶с̶е̶г̶о̶ ̶н̶а̶ ̶с̶в̶е̶т̶е̶” или “ ̶и̶н̶т̶е̶г̶р̶а̶ц̶и̶и̶
        ̶э̶т̶о̶ ̶в̶с̶е̶г̶д̶а̶ ̶с̶л̶о̶ж̶н̶о̶ ̶-̶ ̶з̶а̶к̶л̶а̶д̶ы̶в̶а̶е̶м̶ ̶2̶0̶0̶ ̶ч̶а̶с̶о̶в̶”
      </p>

      <h2>С какими компаниями мы работаем?</h2>

      <p>Мы работаем с компаниями, которые осознали, что быть лидерами в 21 веке невозможно без цифровизации способов общения и
        обслуживания своих внешних и внутренних клиентов.</p>

      <p>Когда клиент гордится своим ИТ-продуктом и постоянно его развивает.</p>

      <p>Когда есть чёткое видение, что получить в итоге.</p>

      <p>Когда клиент готов доверять нашей компетенции и прислушиваться к нашим аргументам.</p>

      <p>Когда клиент понимает, что создание лучшего программного обеспечения — это инвестиции, а не затраты.</p>

      <h2>Время</h2>

      <p>Мы бережем время, свое и своих клиентов, поскольку считаем что это бесценный ресурс. Именно поэтому у нас минимальное
        количество согласований, инструкций и правил. Каждый специалист компании универсален и отвечает за результат, размер
        команды всегда оптимален, для того, чтобы не тратить время на бесконечные совещания.</p>

      <h2>Возможности</h2>

      <p>Мы сами создаем для себя возможности. Мы видим их, если сами того желаем. </p>

      <h2>Доверие и честность</h2>

      <p>Наш успех всегда связан с честностью и ясностью представлений о том, кто мы и что мы делаем. Доверие и честность это на
        100% выбор каждого и зависит от каждого из нас.
        Это прозрачность дел, результатов, целей и идей. Это сосредоточенность на результате, а не на том, кому он будет поставлен
        в заслугу.
      </p>

      <h2>Обратная связь</h2>

      <p>Только правда звучит правдоподобно. </p>

      <p>Мы считаем неприемлемым критику людей в их отсутствии, но одобряем и поддерживаем открытую обратную связь, т.к. она мотивирует и помогает становиться лучше. </p>

      <p>Мы критикуем и активно обсуждаем во время дискуссии, но не имеем права на критику после принятого решения.</p>

      <h2>Ответственность и самостоятельность</h2>

      <p>Люди - не просто персонал. Люди - это личности, способные на многое. Мы поощряем самостоятельность.</p>

      <p>Мы всегда придерживаемся принципа “Кто, если не я”.</p>

      <p>Мы очень высоко ценим способность брать ответственность за себя, за своих коллег и за всю компанию в целом. Мы еще более высоко ценим способность ощущать ответственность за ошибки и промахи, честно признаваться в них.</p>

      <p>Недостаточно говорить то, что делать. Нужно делать то, что говоришь.</p>

      <h2>Результаты</h2>

      <p>Мы всегда говорим и гордимся только достигнутыми результатами. Может быть сотня попыток, но если ни одна из них не дала результата, говорить о них нет смысла.</p>

      <h2>Лидерство</h2>

      <p>Мы уверены, что компанию лидера сможет сделать только команда лидеров.</p>

      <p>Лидерство не определяется ни должностью, ни положением в структуре.</p>

      <p>Для лидера важно то, что обеспечит результат, а не то, что хорошо для карьеры.</p>

      <p>Лидер использует любую возможность для помощи и поддержки коллег. Лидер отлично знает и любит свою команду, ведь только в команде, где каждый обладает уникальными способностями, можно добиться высоких результатов.</p>

      <h2>Творчество</h2>

      <p>Мы ценим постоянный поиск и реализацию новых идей по улучшению деятельности в компании, улучшению сервиса для наших клиентов. Мы поддерживаем разные идеи и мнения, которые нацелены на позитивные изменения. С одним важным условием - от идеи до воплощения. Нам не интересны пассивные мечтатели и “всезнайки”, а только люди, которые хотят и готовы осуществить часть наших целей.</p>

      <h2>Свобода выбора</h2>

      <p>NordClan подходит не всем. Нет компании, которая бы подходила всем. </p>

      <p>Если что-то в работе противоречит вашим внутренним ценностям, лучше честно сказать об этом. В каждой компании есть культура, которая может подойти или не подойти. Покинувшие нас сотрудники перейдут в другие организации и там будут приносить больше пользы, будут более счастливыми.</p>
    </article>
  );
};
